In [1]:
import numpy as np
import pandas as pd

In [2]:
#NaN
#Nan = not a number

SyntaxError: invalid syntax (<ipython-input-2-f9d34ddc14a2>, line 1)

In [48]:
x = pd.DataFrame([['Zoe', 32, np.nan, 59, 'banana'],
                  ['Sam', np.nan, 'M', np.nan, 'peach'],
                  ['Danny', 46, 'M', 81, 'apple']], columns=['name', 'age', 'sex', 'grade', 'fruit'])
x

    name   age  sex  grade   fruit
0    Zoe  32.0  NaN   59.0  banana
1    Sam   NaN    M    NaN   peach
2  Danny  46.0    M   81.0   apple

In [4]:
x.isnull()

    name    age    sex  grade  fruit
0  False  False   True  False  False
1  False   True  False   True  False
2  False  False  False  False  False

In [5]:
x.isnull().sum()

name     0
age      1
sex      1
grade    1
fruit    0
dtype: int64

In [6]:
x.isna().sum()

name     0
age      1
sex      1
grade    1
fruit    0
dtype: int64

In [7]:
x.notnull()

   name    age    sex  grade  fruit
0  True   True  False   True   True
1  True  False   True  False   True
2  True   True   True   True   True

In [8]:
x.notnull().sum()

name     3
age      2
sex      2
grade    2
fruit    3
dtype: int64

In [9]:
x.dropna() #只要有nan的row都清除掉

    name   age sex  grade  fruit
2  Danny  46.0   M   81.0  apple

In [10]:
x.dropna(subset=['sex'])

    name   age sex  grade  fruit
1    Sam   NaN   M    NaN  peach
2  Danny  46.0   M   81.0  apple

In [11]:
x.fillna(99)

    name   age sex  grade   fruit
0    Zoe  32.0  99   59.0  banana
1    Sam  99.0   M   99.0   peach
2  Danny  46.0   M   81.0   apple

In [14]:
x.fillna(x.mean())

<ipython-input-14-db3813443cc9>:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  x.fillna(x.mean())

    name   age  sex  grade   fruit
0    Zoe  32.0  NaN   59.0  banana
1    Sam  39.0    M   70.0   peach
2  Danny  46.0    M   81.0   apple

In [15]:
x.fillna(x.min())

<ipython-input-15-e931a9d76032>:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  x.fillna(x.min())

    name   age  sex  grade   fruit
0    Zoe  32.0  NaN   59.0  banana
1    Sam  32.0    M   59.0   peach
2  Danny  46.0    M   81.0   apple

In [16]:
x.fillna(x.max())

<ipython-input-16-c54e4dcc1547>:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  x.fillna(x.max())

    name   age  sex  grade   fruit
0    Zoe  32.0  NaN   59.0  banana
1    Sam  46.0    M   81.0   peach
2  Danny  46.0    M   81.0   apple

In [17]:
x['age'].fillna(0)

0    32.0
1     0.0
2    46.0
Name: age, dtype: float64

In [51]:
x.fillna({'age':22,'sex':'F','grade':44})

    name   age sex  grade   fruit grade_map grade_apply
0    Zoe  32.0   F   59.0  banana         F           F
1    Sam  22.0   M   44.0   peach         A           A
2  Danny  46.0   M   81.0   apple         B           B

In [19]:
#append
x.append(x)

    name   age  sex  grade   fruit
0    Zoe  32.0  NaN   59.0  banana
1    Sam   NaN    M    NaN   peach
2  Danny  46.0    M   81.0   apple
0    Zoe  32.0  NaN   59.0  banana
1    Sam   NaN    M    NaN   peach
2  Danny  46.0    M   81.0   apple

In [20]:
x.append(x,ignore_index=True)

    name   age  sex  grade   fruit
0    Zoe  32.0  NaN   59.0  banana
1    Sam   NaN    M    NaN   peach
2  Danny  46.0    M   81.0   apple
3    Zoe  32.0  NaN   59.0  banana
4    Sam   NaN    M    NaN   peach
5  Danny  46.0    M   81.0   apple

In [23]:
x=x.set_index('name')
x

In [24]:
x.loc['Zoe']

age        32.0
sex         NaN
grade      59.0
fruit    banana
Name: Zoe, dtype: object

In [25]:
x=x.reset_index()
x

    name   age  sex  grade   fruit
0    Zoe  32.0  NaN   59.0  banana
1    Sam   NaN    M    NaN   peach
2  Danny  46.0    M   81.0   apple

In [26]:
x =x.append(x,ignore_index=True)
x

    name   age  sex  grade   fruit
0    Zoe  32.0  NaN   59.0  banana
1    Sam   NaN    M    NaN   peach
2  Danny  46.0    M   81.0   apple
3    Zoe  32.0  NaN   59.0  banana
4    Sam   NaN    M    NaN   peach
5  Danny  46.0    M   81.0   apple

In [27]:
x.drop_duplicates()

    name   age  sex  grade   fruit
0    Zoe  32.0  NaN   59.0  banana
1    Sam   NaN    M    NaN   peach
2  Danny  46.0    M   81.0   apple

In [28]:
x.drop_duplicates('name')

    name   age  sex  grade   fruit
0    Zoe  32.0  NaN   59.0  banana
1    Sam   NaN    M    NaN   peach
2  Danny  46.0    M   81.0   apple

In [29]:
x.drop_duplicates('sex')

  name   age  sex  grade   fruit
0  Zoe  32.0  NaN   59.0  banana
1  Sam   NaN    M    NaN   peach

In [30]:
x.drop_duplicates(keep='first')

    name   age  sex  grade   fruit
0    Zoe  32.0  NaN   59.0  banana
1    Sam   NaN    M    NaN   peach
2  Danny  46.0    M   81.0   apple

In [31]:
x.drop_duplicates(keep='last')

    name   age  sex  grade   fruit
3    Zoe  32.0  NaN   59.0  banana
4    Sam   NaN    M    NaN   peach
5  Danny  46.0    M   81.0   apple

In [33]:
x=x.drop_duplicates()

In [42]:
x=x.fillna({'sex':'F','grade':65})
x

    name   age sex  grade   fruit  sex_map
0    Zoe  32.0   F   59.0  banana      NaN
1    Sam   NaN   M   65.0   peach      1.0
2  Danny  46.0   M   81.0   apple      1.0

In [43]:
sex ={'M':1,'F':0}
x['sex_map']=x['sex'].map(sex)
x

    name   age sex  grade   fruit  sex_map
0    Zoe  32.0   F   59.0  banana        0
1    Sam   NaN   M   65.0   peach        1
2  Danny  46.0   M   81.0   apple        1

In [55]:
def letter_grade(g):
    if g<60:
        letter = 'F'
    elif g == np.nan:
        letter = 'G'
    elif g<70:
        letter = 'D'
    elif g<80:
        letter = 'C'
    elif g<90:
        letter = 'B'
    else:
        letter = 'A'
    return letter

In [56]:
x['grade_map'] = x['grade'].map(letter_grade)
x

    name   age  sex  grade   fruit grade_map grade_apply
0    Zoe  32.0  NaN   59.0  banana         F           F
1    Sam   NaN    M    NaN   peach         A           A
2  Danny  46.0    M   81.0   apple         B           B

In [52]:
x['grade_apply'] = x['grade'].apply(letter_grade)
x

    name   age  sex  grade   fruit grade_map grade_apply
0    Zoe  32.0  NaN   59.0  banana         F           F
1    Sam   NaN    M    NaN   peach         A           A
2  Danny  46.0    M   81.0   apple         B           B